<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<?php
    // "+" - операция сложения
    // "-" - операция вычитания
    // "*" - операция умножения
    // "/" - операция деления
    // "%" - получение остатка от деления
    // "**" - возведение в степень

$a = 8 + 2; // 10
$a = 8 - 2; // 6
$a = 8 * 2; // 16
$a = 8 / 2; // Chapter4
$a = 8 % 2; // 0
$a = 8 ** 2; // 64

// Инкремент и декремент
// Инкремент "++" - бывает префиксным и постфиксным
$a = 12;
$b = ++$a; // $b равно 13
echo "a = $a b = $b";

$a = 12;
$b = $a++; // $b равно 12
echo "<br>a = $a b = $b";

// Декремент "--" - бывает префиксным и постфиксным
$a = 12;
$b = --$a; // $b равно 11
echo "<br>a = $a b = $b";

$a = 12;
$b = $a--; // $b равно 12
echo "<br>a = $a b = $b";

// Объединение строк
$a = "<br>Привет, ";
$b = " мир";
echo $a . " " . $b . "!";

// Операции сравнения
// "==" - Оператор равенства
// "===" - Оператор тождественности
// "!=" - Сравнивает два значения, если не равны - false
// "!==" - Сравнивает два значения, если не равны - false
// ">" - "Больше чем"
// "<" - "Меньше чем"
// ">=" - "Больше или равно.. "
// "<=" - "Меньше или равно.. "

$a = (2 == "2"); // true (значения равны)
$b = (2 === "2"); // false (значения представляют разные типы)

$a = (2 != "2"); // false (значения равны)
$b = (2 !== "2"); // true (значения представляют разные типы)

// Оператор "<=>", 0 - если равны, 1 - если слева знач. больше чем справа, -1 если знач. справа больше чем слева
$a = 2 <=> 2;
$b = 3 <=> 2;
$c = 1 <=> 2;

echo "<br>a=$a b=$b c=$c";

// Логические операции
// "&&" - Возвращает true, если обе операции сравнения возвращают true
// "and" - Аналогично операции "&&"
// "||" - Возвращает true, если хотя бы одна операция возвращает true
// "or" - Возвращает операции "||"
// "!" - Возвращает true, если операция сравнения возвращает false
// "xor" - Возвращает true, если только одно из значений равно true. Если оба равны true или наоборот не равны, возвращает false

// Поразрядные операции
// "&" - логическое умножение
// "|" - логическое сложение
// "^" - операция исключающего ИЛИ
// "~" - операция логического отрицания
// "<<" - сдвигает число x влево на y разрядов.
// ">>" - сдвигает число x вправо на y разрядов.

// Операции присваивания
// "=" - Приравниваниет значение
// "+=" - Сложение с последующим присвоением результата
$a = 12;
$a += 5;
echo "<br>";
echo $a;
// "-=" - Вычитание с последующим присвоением результата
$a = 12;
$a -= 5;
echo "<br>";
echo $a;
// "*=" - Умножение с последующим присвоением результата
$a = 12;
$a *= 5;
echo "<br>";
echo $a;
// "/=" - Деление с последующим присвоением результата
$a = 12;
$a /= 5;
echo "<br>";
echo $a;
// ".=" - Объединение строк с присвоением результата
$a = 12;
$a .= 5;
echo "<br>";
echo $a;
// "%=" - Получение остатка от деления с присвоением результата
$a = 12;
$a %= 5;
echo "<br>";
echo $a;
// "**=" - Получение результата от возведения в степень
$a = 12;
$a **= 5;
echo "<br>";
echo $a;
// "&=" - Получение результата от операции логического умножения
$a = 12;
$a &= 5;
echo "<br>";
echo $a;
// "|=" - Получение результата от операции логического сложения
$a = 12;
$a |= 5;
echo "<br>";
echo $a;
// "^=" - Получение результата от операции исключающего ИЛИ
$a = 12;
$a |= 5;
echo "<br>";
echo $a;
// "<<=" - Получение результата от операции сдвига влево
$a = 12;
$a <<= 5;
echo "<br>";
echo $a;
// ">>=" - Получение результата от операции сдвига вправо
$a = 12;
$a >>= 5;
echo "<br>";
echo $a;
?>

</body>
</html>